## [infra-mgnt/chatrix](https://infinitepi-io.app.spacelift.io/stack/chatrix__158710814571_chatrix/run/01K95689GTE4QKEDRNH1F3Y8NC) plan logs

<details>
<summary>Click here to expand</summary>

```
[01K952TPMBGB237NM36NEDBN4X] Planning changes with 0 custom hooks...
[01K952TPMBGB237NM36NEDBN4X] Still running...
data.aws_acm_certificate.chatrix: Reading...
aws_iam_role.chatrix_lambda: Refreshing state... [id=chatrix-lambda-role]
aws_ecr_repository.chatrix: Refreshing state... [id=infinite-pi/chatrix]
data.aws_secretsmanager_secret.chatrix_api_key: Reading...
data.aws_acm_certificate.chatrix: Read complete after 1s [id=arn:aws:acm:us-east-1:158710814571:certificate/d6798286-c62b-4000-a06f-ee13dd46bf05]
data.aws_secretsmanager_secret.chatrix_api_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:158710814571:secret:prod/chatrix/api-key-neVOYz]
aws_iam_policy.chatrix_permissions: Refreshing state... [id=arn:aws:iam::158710814571:policy/chatrix-permissions]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.chatrix will be created
  + resource "aws_cloudfront_distribution" "chatrix" {
      + aliases                         = [
          + "chatrix.infinitepi-io.org",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "CloudFront distribution for Chatrix Lambda Function"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Name" = "chatrix-cloudfront"
        }
      + tags_all                        = {
          + "Environment"     = "Production"
          + "ManagedBy"       = "Terraform"
          + "Name"            = "chatrix-cloudfront"
          + "SpendAllocation" = "Infrastructure"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods          = [
              + "OPTIONS",
              + "POST",
            ]
          + cache_policy_id          = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "b689b0a8-53d0-40ab-baf2-68738e2966ac"
          + target_origin_id         = "chatrix-lambda"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_id                   = "chatrix-lambda"
          + response_completion_timeout = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:158710814571:certificate/d6798286-c62b-4000-a06f-ee13dd46bf05"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudwatch_log_group.chatrix will be created
  + resource "aws_cloudwatch_log_group" "chatrix" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/chatrix"
      + name_prefix       = (known after apply)
      + region            = "us-west-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment"     = "Production"
          + "ManagedBy"       = "Terraform"
          + "SpendAllocation" = "Infrastructure"
        }
    }

  # aws_ecr_lifecycle_policy.chatrix will be created
  + resource "aws_ecr_lifecycle_policy" "chatrix" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "us-west-2"
      + registry_id = (known after apply)
      + repository  = "infinite-pi/chatrix"
    }

  # aws_iam_role_policy_attachment.chatrix_permissions will be created
  + resource "aws_iam_role_policy_attachment" "chatrix_permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::158710814571:policy/chatrix-permissions"
      + role       = "chatrix-lambda-role"
    }

  # aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "chatrix-lambda-role"
    }

  # aws_lambda_function.chatrix will be created
  + resource "aws_lambda_function" "chatrix" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "chatrix"
      + id                             = (known after apply)
      + image_uri                      = "158710814571.dkr.ecr.us-west-2.amazonaws.com/infinite-pi/chatrix:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-west-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::158710814571:role/chatrix-lambda-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment"     = "Production"
          + "ManagedBy"       = "Terraform"
          + "SpendAllocation" = "Infrastructure"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AWS_REGION" = "us-west-2"
              + "SecretName" = "prod/chatrix/api-key"
            }
        }
    }

  # aws_lambda_function_url.chatrix will be created
  + resource "aws_lambda_function_url" "chatrix" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "chatrix"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + region             = "us-west-2"
      + url_id             = (known after apply)

      + cors {
          + allow_credentials = true
          + allow_headers     = [
              + "*",
            ]
          + allow_methods     = [
              + "*",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 86400
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudfront_domain_name = (known after apply)
  + cloudfront_url         = (known after apply)
  + cloudwatch_log_group   = "/aws/lambda/chatrix"
  + lambda_function_arn    = (known after apply)
  + lambda_function_name   = "chatrix"
  + lambda_function_url    = (known after apply)
[01K952TPMBGB237NM36NEDBN4X] Changes are GO
[01K952TPMBGB237NM36NEDBN4X] Still running...
[01K952TPMBGB237NM36NEDBN4X] Uploading the list of managed resources...
[01K952TPMBGB237NM36NEDBN4X] Please be aware that the run changes calculation includes output changes.
[01K952TPMBGB237NM36NEDBN4X] Resource list upload is GO
[01K952TPMBGB237NM36NEDBN4X] Generating JSON representation of the plan...
[01K952TPMBGB237NM36NEDBN4X] JSON representation is GO
[01K952TPMBGB237NM36NEDBN4X] Loading custom plan policy inputs...
[01K952TPMBGB237NM36NEDBN4X] 0 custom plan policy inputs found
[01K952TPMBGB237NM36NEDBN4X] No plan policies to evaluate
```

</details>